/*************************************************************************************************
 * @file		dacTask.h
 *
 * @brief		Заголовок драйвера ЦАП
 *
 * @version		v1.0
 * @date		03.09.2013
 * @author		Mike Smith
 *
 ************************************************************************************************/
#ifndef TASKDAC_H_
#define TASKDAC_H_


//*-----------------------------------------------------------------------------------------------
//*			Описание типов
//*-----------------------------------------------------------------------------------------------
/// команды управления ЦАП
typedef enum
{
	DAC_SET_SRATE,
	DAC_START,
	DAC_PAUSE,
	DAC_CONTINUE,
	DAC_STOP,
	DAC_DATA
} dac_cmd_t;


/// состояние ЦАП
typedef enum
{
	DAC_STOPPED,
	DAC_PAUSED,
	DAC_WORK
} dac_state_t;


/// формат mail с данными для воспроизведения
typedef struct
{
	dac_cmd_t dac_cmd;
	uint32_t * data_ptr;
	uint32_t data_size;
} dac_data_portion_t;


/// формат mail с командой настройки битрейта
typedef struct
{
	uint8_t dac_cmd;
	uint32_t sample_rate;
} dac_srate_t;


//*-----------------------------------------------------------------------------------------------
//*			Переменные модуля
//*-----------------------------------------------------------------------------------------------
extern int  dac_DataReqFlag;	///< этот флаг устанавливается при необходимости декодирования новой порции данных
extern int  dac_CmdMailbox;	///< сюда посылать команды для управления ЦАП


//*-----------------------------------------------------------------------------------------------
//*			Функции модуля
//*-----------------------------------------------------------------------------------------------
void DAC_TaskInit(void);			///< инициализация модуля


#endif
