/*************************************************************************************************
 * @file		playerTask.h
 *
 * @brief		Заголовок модуля главного проигрывателя
 *
 * @version		v1.0
 * @date		10.09.2013
 * @author		Mike Smith
 *
 ************************************************************************************************/
#ifndef PLAYERTASK_H_
#define PLAYERTASK_H_

#include "FreeRTOS.h"
#include "task.h"

//*-----------------------------------------------------------------------------------------------
//*			Типы
//*-----------------------------------------------------------------------------------------------
/// команды управления проигрывателем
typedef enum
{
	CMD_NONE,
	CMD_INIT,
	CMD_DEINIT,
	CMD_START,		// начать воспроизведение
	CMD_STOP,		// остановить воспроизведение
	CMD_PAUSE,		// сделать паузу
	CMD_NEXT,		// следующий трек
//	CMD_CONTINUE,	// продолжить

	SONG_COMPLETE,	// текущий трек проигран полностью
	DECODE_ERROR,	// ошибка декодирования текущего трека
} cmd_t;


/// состояние плейера
typedef enum
{
	NO_INIT,
	PLAYING,
	STOPPED,
	PAUSED,
} player_state_t;


/// параметры для декодера
typedef struct
{
	FIL * file;
	QueueHandle_t dacDataReqFlag;
	QueueHandle_t playCmdMailBox;
	QueueHandle_t dacCmdMailbox;
} decoder_param_t;


//*-----------------------------------------------------------------------------------------------
//*			Переменные
//*-----------------------------------------------------------------------------------------------
///player_state_t playerState;


//*-----------------------------------------------------------------------------------------------
//*			Функции модуля
//*-----------------------------------------------------------------------------------------------
xTaskHandle* playerCtrlInit(void);


#endif /* PLAYERTASK_H_ */
